package com.example.sergejmitrofanov.librarycatalogue.repository;

import androidx.annotation.NonNull;
import com.example.sergejmitrofanov.librarycatalogue.entity.Book;
import com.example.sergejmitrofanov.librarycatalogue.interactor.BooksSource;
import java.util.Arrays;
import java.util.List;
import javax.inject.Inject;

public class DarkNetBooksSource implements BooksSource {

  @Inject
  DarkNetBooksSource() {
  }

  @NonNull
  @Override
  public List<Book> getBooks() {
    return Arrays.asList(
        new Book("Владимир Набоков", "Лолита", 7),
        new Book("Элис Уокер", "Фиолетовый цвет", 1),
        new Book("Марк Твен", "Приключения Гекльберри Финна", 4),
        new Book("Питер Райт", "Ловец шпионов", 9),
        new Book("Джеффри Чосер", "Кентерберийские рассказы", 7),
        new Book("Рэй Брэдбери", "451 градус по Фаренгейту", 5),
        new Book("Джуди Блум", "Навсегда", 8),
        new Book("Трумен Капоте", "Хладнокровное убийство", 3),
        new Book("Джеймс Джойс", "Улисс", 3),
        new Book("Питер Парнелл и Джастин Ричардсон", "C Танго их трое", 3),
        new Book("Ди Эйч Лоуренс", "Любовник леди Чаттерли", 0),
        new Book("Рэдклифф Холл", "Колодец одиночества", 9),
        new Book("Сэр Артур Конан Дойл", "Этюд в багровых тонах", 7),
        new Book("Харпер Ли", "Убить пересмешника", 5),
        new Book("Аун Сан Су Чжи", "Письма из Бирмы", 3),
        new Book("Адольф Гитлер", "Моя борьба", 4),
        new Book("Уильям Стейг", "Сильвестр и магический камешек", 4),
        new Book("Эрже", "Голубой лотос", 7),
        new Book("Якоб и Вильгельм Гримм", "Собрание сказок братьев Гримм", 0),
        new Book("Эбби Хоффман", "Сопри эту книгу", 5),
        new Book("Льюис Кэрролл", "Алиса в стране чудес", 3),
        new Book("Цзюн Чан", "Дикие лебеди", 7),
        new Book("Салман Рушди", "Сатанинские стихи", 4),
        new Book("Джордж Оруэлл", "Скотный двор", 7),
        new Book("Уильям Голдинг", "Повелитель мух", 4),
        new Book("Роальд Даль", "Ведьмы", 1),
        new Book("Джон Апдайк", "Кролик, беги!", 9),
        new Book("Подполковник Энтони Шаффер", "Операция «Чёрное сердце", 9),
        new Book("Мартин Хэндфорд", "Где Уолдо?", 2),
        new Book("Эрнест Хемингуэй", "Прощай, оружие!", 1),
        new Book("Джей Ди Сэлинджер", " Над пропастью во ржи", 6),
        new Book("Борис Пастернак", "Доктор Живаго", 5),
        new Book("Бетти Махмуди", "Только с дочерью", 3),
        new Book("Брет Истон Эллис", "Американский психопат", 8),
        new Book("Дэн Браун", "Код да Винчи", 0),
        new Book("Эрих Мария Ремарк", "На Западном фронте без перемен", 8),
        new Book("Гюстав Флобер", "Мадам Бовари", 8),
        new Book("Гарриет Бичер-Стоу", "Хижина дяди Тома", 1),
        new Book("Маргарет Этвуд", "Рассказ служанки", 7),
        new Book("Стефани Майер", "Сумерки", 4),
        new Book("Джон Клеланд", "Фанни Хилл", 9),
        new Book("Тони Моррисон", "Возлюбленная", 1),
        new Book("Энид Блайтон", "Великолепная пятёрка", 8),
        new Book("Анна Сьюэлл", "Чёрная красавица", 0),
        new Book("Анна Франк", "Дневник девочки", 7),
        new Book("Джон Стейнбек", "Гроздья гнева", 6),
        new Book("Лаймен Фрэнк Баум", "Удивительный волшебник из страны Оз", 6),
        new Book("Халед Хоссейни", "Бегущий за ветром", 4)
    );
  }
}
