package com.example.sergejmitrofanov.librarycatalogue.repository

import com.example.sergejmitrofanov.librarycatalogue.entity.Book
import com.example.sergejmitrofanov.librarycatalogue.interactor.BooksSource
import javax.inject.Inject

class FavoritesBooksSource @Inject constructor() : BooksSource {
    override fun getBooks() = listOf(
        Book("Хорхе Луис Борхес", "Вымыслы", 9),
        Book("Вирджиния Вулф", "Миссис Дэллоуэй", 8),
        Book("Чинуа Ачебе", "И пришло разрушение", 10),
        Book("Вьяса", "Махабхарата", 8),
        Book("Кнут Гамсун", "Голод", 9),
        Book("Оноре де Бальзак", "Отец Горио", 10),
        Book("Габриэль Гарсиа Маркес", "Сто лет одиночества", 7),
        Book("Эмили Бронте", "Грозовой перевал", 9),
        Book("Сэмюэл Беккет", "Трилогия (Моллой, Мэлон умирает, Безымянный)", 9),
        Book("Гомер", "Одиссея", 10),
        Book("Данте Алигьери", "Божественная комедия", 10),
        Book("Вальмики", "Рамаяна", 8),
        Book("Ханс Кристиан Андерсен", "Сказки", 10),
        Book("Вергилий", "Энеида", 8),
        Book("Джованни Боккаччо", "Декамерон", 9),
        Book("Джеймс Джойс", "Улисс", 7),
        Book("Гюнтер Грасс", "Жестяной барабан", 9),
        Book("Вирджиния Вулф", "На маяк", 8),
        Book("Николай Васильевич Гоголь", "Мёртвые души", 7),
        Book("Габриэль Гарсиа Маркес", "Любовь во время чумы", 7),
        Book("Альфред Дёблин", "Берлин Александрплац", 8),
        Book("Иоганн Вольфганг фон Гёте", "Фауст", 10),
        Book("Федерико Гарсиа Лорка", "Цыганское романсеро", 7),
        Book("Жуан Гимарайнс Роза", "Тропы по большому сертану", 9),
        Book("Гомер", "Илиада", 7)
    )
}
