package com.example.sergejmitrofanov.librarycatalogue.repository;

import androidx.annotation.NonNull;
import com.example.sergejmitrofanov.librarycatalogue.entity.Book;
import com.example.sergejmitrofanov.librarycatalogue.interactor.BooksSource;
import java.util.Arrays;
import java.util.List;

public class NetworkBooksSource implements BooksSource {

  @NonNull
  @Override
  public List<Book> getBooks() {
    return Arrays.asList(
        new Book("Роберт Музиль", "Человек без свойств", 8),
        new Book("Уолт Уитмен", "Листья травы", 3),
        new Book("Нагиб Махфуз", "Предания нашей улицы", 8),
        new Book("Дэвид Герберт Лоуренс", "Сыновья и любовники", 4),
        new Book("Ясунари Кавабата", "Стон горы", 9),
        new Book("Лев Толстой", "Анна Каренина", 1),
        new Book("Лу Синь", "Записки сумасшедшего", 3),
        new Book("Стендаль", "Красное и чёрное", 8),
        new Book("Дорис Лессинг", "Золотая тетрадь", 3),
        new Book("Гюстав Флобер", "Госпожа Бовари", 6),
        new Book("Джонатан Свифт", "Путешествия Гулливера", 0),
        new Book("Софокл", "Эдип-царь", 8),
        new Book("Тони Моррисон", "Возлюбленная", 6),
        new Book("Салман Рушди", "Дети полуночи", 1),
        new Book("Франц Кафка", "Рассказы", 1),
        new Book("Джакомо Леопарди", "Стихи", 7),
        new Book("Гюстав Флобер", "Воспитание чувств", 5),
        new Book("Мигель де Сервантес", "Хитроумный идальго Дон Кихот Ламанчский", 0),
        new Book("Франц Кафка", "Процесс", 3),
        new Book("Никос Казандзакис", "Невероятные похождения Алексиса Зорбаса", 8),
        new Book("Маргерит Юрсенар", "Воспоминания Адриана", 4),
        new Book("Эльза Моранте", "История", 2),
        new Book("Фёдор Достоевский", "Идиот", 7),
        new Book("Саади", "Бустан", 6),
        new Book("Уильям Фолкнер", "Шум и ярость", 3),
        new Book("Фернанду Пессоа", "Книга непокоя", 1),
        new Book("Дени Дидро", "Жак-фаталист и его хозяин", 1),
        new Book("Владимир Набоков", "Лолита", 8),
        new Book("Эрнест Хемингуэй", "Старик и море", 0),
        new Book("Лев Толстой", "Смерть Ивана Ильича", 2),
        new Book("Лев Толстой", "Война и мир", 7),
        new Book("Альбер Камю", "Посторонний", 8),
        new Book("Лоренс Стерн", "Жизнь и мнения Тристрама Шенди, джентльмена", 5),
        new Book("Джеффри Чосер", "Кентерберийские рассказы", 5),
        new Book("Герман Мелвилл", "Моби Дик", 3),
        new Book("Еврипид", "Медея", 9),
        new Book("Итало Звево", "Самопознание Дзено", 8),
        new Book("Фёдор Достоевский", "Братья Карамазовы", 4),
        new Book("Ральф Эллисон", "Человек-невидимка", 2),
        new Book("Жозе Сарамаго", "Слепота", 4),
        new Book("Джордж Элиот", "Мидлмарч", 5),
        new Book("Пауль Целан", "Стихотворения", 2),
        new Book("Джордж Оруэлл", "1984", 6),
        new Book("Мурасаки Сикибу", "Повесть о блистательном принце Гэндзи", 1),
        new Book("Чарльз Диккенс", "Большие надежды", 0),
        new Book("Джейн Остин", "Гордость и предубеждение", 4),
        new Book("Антон Чехов", "Рассказы", 2),
        new Book("Калидаса", "Шакунтала", 0),
        new Book("Генрик Ибсен", "Кукольный дом", 8),
        new Book("Джалаладдин Руми", "Маснави", 9),
        new Book("Томас Манн", "Будденброки", 2),
        new Book("Тайиб Салих", "Сезон паломничества на Север", 8),
        new Book("Джозеф Конрад", "Ностромо", 9),
        new Book("Уильям Фолкнер", "Авессалом, Авессалом!", 7),
        new Book("Халлдор Кильян Лакснесс", "Самостоятельные люди", 7),
        new Book("Эдгар Аллан По", "Рассказы", 5),
        new Book("Томас Манн", "Волшебная гора", 2),
        new Book("Марсель Пруст", "В поисках утраченного времени", 2),
        new Book("Публий Овидий Назон", "Метаморфозы", 4),
        new Book("Марк Твен", "Приключения Гекльберри Финна", 5),
        new Book("Фёдор Достоевский", "Преступление и наказание", 0),
        new Book("Фёдор Достоевский", "Бесы", 9),
        new Book("Луи-Фердинанд Селин", "Путешествие на край ночи", 4),
        new Book("Франсуа Рабле", "Гаргантюа и Пантагрюэль", 8),
        new Book("Уильям Шекспир", "Отелло", 0),
        new Book("Уильям Шекспир", "Король Лир", 7),
        new Book("Хуан Рульфо", "Педро Парамо", 2),
        new Book("Мишель де Монтень", "Опыты", 7),
        new Book("Астрид Линдгрен", "Пеппи Длинныйчулок", 4),
        new Book("Уильям Шекспир", "Гамлет", 3),
        new Book("Франц Кафка", "За́мок", 4)
    );
  }
}
